base/DataProcessors/бит_ЗагрузкаФормСбораДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ЗагрузкаФормСбораДанных</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Путь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимСообщений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПерезапись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыбора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СозданныеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выполнять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СозданныйОбъект</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_ФормаСбораДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

base/Documents/бит_ФормаСбораДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ФормаСбораДанных</Name>
			<BasedOn>
				<xr:Item>Catalog.бит_ВидыФормСбораДанных</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.бит_Дополнительный_4</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоБюджетам</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_3</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_1</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.бит_СоответствиеОборотовТрансляции</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоТипамПроводок</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПроизвольныхПараметров</xr:Item>
				<xr:Item>AccountingRegister.бит_Бюджетирование</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_5</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_2</xr:Item>
				<xr:Item>InformationRegister.бит_ЗначенияПроизвольныхПараметров</xr:Item>
				<xr:Item>InformationRegister.бит_СоответствиеЗаписейТрансляции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерПроформы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидФормыСбораДанных</Name>
					<Comment>Вид формы сбора данных</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВидыФормСбораДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Comment>Кратность документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьВЗакрытомПериоде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеШапки</Name>
					<Comment>Данные шапки</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Comment>Имя реквизита</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеРеквизита</Name>
							<Comment>Значение реквизита</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеТабличныхЧастей</Name>
					<Comment>Данные табличных частей</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяТабличнойЧасти</Name>
							<Comment>Имя табличной части</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиТаблицы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Comment>Имя реквизита</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеРеквизита</Name>
							<Comment>Значение реквизита</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/Catalogs/бит_ВидыФормСбораДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ВидыФормСбораДанных</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Comment>Имя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОбработчикаПроведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтекПеременных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиРеквизитов</Name>
					<Comment>Настройки реквизитов</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяТаблицы</Name>
							<Comment>Имя таблицы</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Comment>Синоним</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрТип</Name>
							<Comment>Доступные типы значений в строковом представлении</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Comment>Служит для связи с данными дерева</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПоля</Name>
							<Comment>Вид поля</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыПолейПроформы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроверкаЗаполнения</Name>
							<Comment>Проверка заполнения</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КнопкаВыбора</Name>
							<Comment>Кнопка выбора</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ДаНетАвто</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КнопкаОчистки</Name>
							<Comment>Кнопка очистки</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ДаНетАвто</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КнопкаОткрытия</Name>
							<Comment>Кнопка открытия</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ДаНетАвто</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Comment>Ширина</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КнопкаРегулирования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ДаНетАвто</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выгружать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыражениеПредставления</Name>
							<Comment>Выражение представления</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеНастроек</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкиУстановлены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыводитьИтог</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиДвижений</Name>
					<Comment>Движения</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Активность</Name>
							<Comment>Активность</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонДвижений</Name>
							<Comment>Шаблон движений</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныДвижений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/DataProcessors/бит_ЗагрузкаФормСбораДанных/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	Если НЕ бит_ЛицензированиеБФСерверПереопределяемый.СборкаДоступна("УХ") Тогда	
		Отказ = Истина;	
	КонецЕсли; 
	
	КоллекцияПсевдоМета = Новый Структура;
	Объект.РежимСообщений = "Все";
	Объект.РежимЗаписи = "Запись";
	
	ЗаполнитьКэшЗначений();
	
	УстановитьЗначенияПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    УстановитьЗаголовокФормы();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПутьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	# Если ВебКлиент Тогда 
		ТекстСообщения = НСтр("ru='Работа с файлами Microsoft Excel в режиме Веб-клиента недоступна.';
						  	  |en='Working with Microsoft Excel files in mobile client mode is not available.'");
		ВызватьИсключение ТекстСообщения;
	# КонецЕсли
	
	ОповещениеПФ = Новый ОписаниеОповещения("ПутьВыборЗавершение", ЭтотОбъект);
	
	Если Объект.РежимВыбора = 1 Тогда		
		ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
		ПараметрыЗагрузки.Диалог.Заголовок = НСтр("ru='Выбор файла';en='File selection'");
	    ПараметрыЗагрузки.Диалог.Фильтр = НСтр("ru='Все файлы Microsoft Excel (*.xls, *.xlsx)|*.xls; *.xlsx';
											   |en='All Microsoft Excel Files (*.xls, *.xlsx)|*.xls; *.xlsx'");
		ФайловаяСистемаКлиент.ЗагрузитьФайлы(ОповещениеПФ, ПараметрыЗагрузки, Объект.Путь);
	Иначе	
		
		ФайловаяСистемаКлиент.ВыбратьКаталог(ОповещениеПФ,, Объект.Путь);
	КонецЕсли;
	 	
КонецПроцедуры

// Процедура обработчик оповещения "ПутьВыборЗавершение".
// 
// Параметры:
// ВыбранныеПути - Массив.
// ДополнительныеДанные - Структура.
// 
&НаКлиенте 
Процедура ПутьВыборЗавершение(ВыбранныеПути, ДополнительныеДанные) Экспорт

	Если НЕ ЗначениеЗаполнено(ВыбранныеПути) Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныеФайлы.Очистить();
	
	Если ТипЗнч(ВыбранныеПути) = Тип("Строка") Тогда
			
		Объект.Путь = ВыбранныеПути;
		
	ИначеЕсли ТипЗнч(ВыбранныеПути) = Тип("Массив") Тогда

		Объект.Путь = ВыбранныеПути[0].Имя;

		Для каждого ТекПуть Из ВыбранныеПути Цикл			 
			ВыбранныеФайлы.Добавить(ТекПуть.Имя);			 
		КонецЦикла; 

	КонецЕсли; 
	
	УправлениеДоступностьюЭлементов(Ложь);
	ПодключитьОбработчикОжидания("ОжиданиеВыбораПути", 0.1, Истина);
		
КонецПроцедуры	// ПутьВыборЗавершение

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДереводанные

&НаКлиенте
Процедура ДеревоДанныеПредставлениеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ДеревоДанные.ТекущиеДанные;
	
	Если НЕ ПустаяСтрока(ТекущаяСтрока.ИмяФайла) Тогда
	
		ФайловаяСистемаКлиент.ОткрытьФайл(ТекущаяСтрока.ИмяФайла);
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДанныеВидПроформыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДанныеВыполнятьПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДеревоДанные.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		КодДействия = ?(ТекущаяСтрока.Выполнять, 1, 0); 
		
		ИзменитьФлажки(ТекущаяСтрока,КодДействия);
		
		// Если устанавливаем флаг для листа, то нужно установить флаг и для файла.
		СтрокаРодитель = ТекущаяСтрока.ПолучитьРодителя();
		
		Если СтрокаРодитель <> Неопределено И ТекущаяСтрока.Выполнять Тогда		
			СтрокаРодитель.Выполнять = Истина;		
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСозданныеобъекты

&НаКлиенте
Процедура СозданныеОбъектыСозданныйОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗагрузить(Команда)
	
	ЗагрузитьДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНастройки(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимСообщений"	 , Объект.РежимСообщений);
	ПараметрыФормы.Вставить("РежимЗаписи"		 , Объект.РежимЗаписи);
	ПараметрыФормы.Вставить("РазрешитьПерезапись", Объект.РазрешитьПерезапись);
	
	РежимОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	Оповещение = Новый ОписаниеОповещения("НастройкиЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.бит_ЗагрузкаФормСбораДанных.Форма.ФормаНастройки",
				 ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОкна);
	
КонецПроцедуры

// Процедура обработчик оповещения "НастройкиЗавершение".
// 
// Параметры:
// Рез - Структура.
// ДополнительныеДанные - Структура.
// 
&НаКлиенте 
Процедура НастройкиЗавершение(Результат, ДополнительныеДанные) Экспорт

	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		Объект.РежимСообщений 	   = Результат.РежимСообщений;
		Объект.РежимЗаписи 		   = Результат.РежимЗаписи;
		Объект.РазрешитьПерезапись = Результат.РазрешитьПерезапись;
		
	КонецЕсли; 
	
КонецПроцедуры	// НастройкиЗавершение

&НаКлиенте
Процедура ЗагруженныеОбъектыУстановитьВсе(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.СозданныеОбъекты, "Выполнять", 1, Элементы.СозданныеОбъекты);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагруженныеОбъектыСнятьВсе(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.СозданныеОбъекты, "Выполнять", 0, Элементы.СозданныеОбъекты);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагруженныеОбъектыИнвертировать(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.СозданныеОбъекты, "Выполнять", 2, Элементы.СозданныеОбъекты);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагруженныеОбъектыУдалить(Команда)
	
    Если Объект.СозданныеОбъекты.Количество() = 0 Тогда
        Возврат
    КонецЕсли;
    
    ТекстВопроса = НСтр("ru='Удалить объекты без возможности восстановления?';
					    |en='Remove objects without restoration possibility?'");
    Оповещение = Новый ОписаниеОповещения("ВопросОбУдаленииОбъектовЗавершение", ЭтотОбъект); 
    ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);
		
КонецПроцедуры

// Процедура - обработчик оповещения "ВопросОбУдаленииОбъектовЗавершение".
// 
&НаКлиенте
Процедура ВопросОбУдаленииОбъектовЗавершение(Ответ, ДополнительныеДанные) Экспорт
	
	Если НЕ  Ответ = КодВозвратаДиалога.Да Тогда
	    Возврат;
	КонецЕсли;
	
	УдалитьЗагруженныеОбъекты();
	
КонецПроцедуры // ВопросОбУдаленииОбъектовЗавершение()
 
&НаКлиенте
Процедура ЗагруженныеОбъектыОчистить(Команда)
	
	Если Объект.СозданныеОбъекты.Количество() > 0 Тогда
		
		ТекстВопроса = НСтр("ru='Список созданных объектов будет очищен. Продолжить?';
							|en='List of created objects will be cleared. Continue?'");
		Оповещение = Новый ОписаниеОповещения("ВопросОбОчисткеСозданныхОбъектовЗавершение", ЭтотОбъект); 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);
			
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик оповещения "ВопросОбОчисткеСозданныхОбъектовЗавершение".
// 
&НаКлиенте
Процедура ВопросОбОчисткеСозданныхОбъектовЗавершение(Ответ, ДополнительныеДанные) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.СозданныеОбъекты.Очистить();
	КонецЕсли;

КонецПроцедуры // ВопросОбОчисткеСозданныхОбъектовЗавершение()
 
&НаКлиенте
Процедура ДанныеЗагрузкиУстановитьВсе(Команда)
	
	ИзменитьФлажки(ДеревоДанные, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеЗагрузкиСнятьВсе(Команда)
	
	ИзменитьФлажки(ДеревоДанные, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеЗагрузкиИнвертировать(Команда)
	
	ИзменитьФлажки(ДеревоДанные, 2);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	УправлениеДоступностьюЭлементов(Ложь);
	ОбновитьДеревоДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьНастройки(Команда)
	
	СохранитьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВосстановитьНастройки(Команда)
	
	ВосстановитьНастройки();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Настройки

// Процедура открывает форму сохранения настроек.
// 
&НаКлиенте
Процедура СохранитьНастройки()

	ПараметрыФормы     = Новый Структура;
	СтруктураНастройки = УпаковатьНастройкиВСтруктуру();
	ПараметрыФормы.Вставить("СтруктураНастройки",СтруктураНастройки);
	ПараметрыФормы.Вставить("ТипНастройки",фКэшЗначений.Перечисления.бит_ТипыСохраненныхНастроек.Обработки);
	ПараметрыФормы.Вставить("НастраиваемыйОбъект",фКэшЗначений.НастраиваемыйОбъект);
	ПараметрыФормы.Вставить("СохраненнаяНастройка", ТекущаяНастройка);
	
	РежимОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	Оповещение = Новый ОписаниеОповещения("СохранитьНастройкиЗавершение", ЭтотОбъект);
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаСохранения",ПараметрыФормы,ЭтотОбъект,,,,Оповещение,РежимОкна);

КонецПроцедуры // СохранитьНастройки()

// Процедура обработчик оповещения "СохранитьНастройкиЗавершение".
// 
// Параметры:
// РезНастройка - Произвольный.
// ДополнительныеДанные - Структура.
// 
&НаКлиенте 
Процедура СохранитьНастройкиЗавершение(РезНастройка, ДополнительныеДанные) Экспорт

	Если ЗначениеЗаполнено(РезНастройка) Тогда
	
		ТекущаяНастройка = РезНастройка;
		УстановитьЗаголовокФормы();
	
	КонецЕсли; 
	
КонецПроцедуры	// СохранитьНастройкиЗавершение

// Процедура открывает форму восстановления настроек.
// 
&НаКлиенте
Процедура ВосстановитьНастройки()

	ПараметрыФормы     = Новый Структура;
	ПараметрыФормы.Вставить("ТипНастройки"		 , фКэшЗначений.Перечисления.бит_ТипыСохраненныхНастроек.Обработки);
	ПараметрыФормы.Вставить("НастраиваемыйОбъект", фКэшЗначений.НастраиваемыйОбъект);
	
	РежимОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	Оповещение = Новый ОписаниеОповещения("ВосстановитьНастройкиЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаЗагрузки",
		ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОкна);

КонецПроцедуры // ВосстановитьНастройки()

// Процедура обработчик оповещения "ВосстановитьНастройкиЗавершение".
// 
// Параметры:
// ВыбНастройка - Произвольный.
// ДополнительныеДанные - Структура.
// 
&НаКлиенте 
Процедура ВосстановитьНастройкиЗавершение(ВыбНастройка, ДополнительныеДанные) Экспорт

	Если ЗначениеЗаполнено(ВыбНастройка) Тогда
		
		ТекущаяНастройка = ВыбНастройка;
		ПрименитьНастройки(ВыбНастройка);
	
	КонецЕсли; 
	
КонецПроцедуры	// ВосстановитьНастройкиЗавершение

// Функция создает структуру, хранящую настройки панели индикаторов.
// 
// Возвращаемое значение:
//   СтруктураНастроек - Структура.
// 
&НаСервере
Функция УпаковатьНастройкиВСтруктуру()

	Исключения = Новый Массив;
	Исключения.Добавить("РежимВыбора");
	
	СтруктураНастроек = Новый Структура;

	Для каждого МетаРеквизит Из Метаданные.Обработки.бит_ЗагрузкаФормСбораДанных.Реквизиты Цикл
		
		Если НЕ Исключения.Найти(МетаРеквизит.Имя) = Неопределено Тогда
		
			Продолжить;
		
		КонецЕсли; 
		
		СтруктураНастроек.Вставить(МетаРеквизит.Имя, Объект[МетаРеквизит.Имя]);
	
	КонецЦикла; 
	
	Возврат СтруктураНастроек;
	
КонецФункции // УпаковатьНастройкиВСтруктуру()

// Процедура применяет сохраненну настройку к панели индикаторов.
// 
// Параметры:
//  ВыбНастройка  - СправочникСсылка.бит_СохраненныеНастройки.
// 
&НаСервере
Процедура ПрименитьНастройки(ВыбНастройка)
	
	СтруктураНастроек = ВыбНастройка.ХранилищеНастроек.Получить();
	
	Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		
		Для каждого КиЗ Из СтруктураНастроек Цикл
			
			Имя = КиЗ.Ключ;
			Знч = КиЗ.Значение;
			
			Если бит_РаботаСМетаданными.ЕстьРеквизит(Имя, Метаданные.Обработки.бит_ЗагрузкаФормСбораДанных) Тогда			
				Объект[Имя] = Знч;			
			КонецЕсли; 
		
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры // ПрименитьНастройки()

// Процедура устанавливает настройку либо из последних использованных, либо из настройки по умолчанию.
// 
&НаСервере
Процедура УстановитьЗначенияПоУмолчанию()
	
	// Получим настройку по - умолчанию и последнюю использованну.
	НастройкаПоУмолчанию = бит_ОтчетыСервер.НайтиНастройкуПоУмолчаниюДляОбъекта(фКэшЗначений.НастраиваемыйОбъект);

	// Установим настройку
	Если ЗначениеЗаполнено(НастройкаПоУмолчанию) Тогда
		ПрименитьНастройки(НастройкаПоУмолчанию);
	КонецЕсли; 
	
КонецПроцедуры // УстановитьЗначенияПоУмолчанию()

#КонецОбласти

// Процедура заполняет кэш значений, для последующего использования на клиенте.
// 
&НаСервере
Процедура ЗаполнитьКэшЗначений()
	
	фКэшЗначений = Новый Структура;
	
	фКэшЗначений.Вставить("НастраиваемыйОбъект"	, "Обработка.бит_ЗагрузкаФормСбораДанных");
	
	// Перечисления
	КэшПеречисления = Новый Структура;
	
	ТекПеречисление = бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_ТипыСохраненныхНастроек);
	КэшПеречисления.Вставить("бит_ТипыСохраненныхНастроек",ТекПеречисление);
	
	фКэшЗначений.Вставить("Перечисления",КэшПеречисления);
	
КонецПроцедуры // ЗаполнитьКэшЗначений() 

// Процедура заполняет в модели документа Дату и НомерПроформы.
// 
// Параметры:
//  МодельДокумента  - Структура.
//  ПсевдоМетаданные - Структура;
//
&НаСервере
Процедура ЗаполнитьНомерДату(МодельДокумента, ПсевдоМетаданные)
	
	Если НЕ МодельДокумента.Свойство("НомерПроформы") Тогда
		
		МетаРеквизит = ПсевдоМетаданные.СтандартныеРеквизиты.Найти("НомерПроформы");
		ТекЗнч = бит_ПроформыКлиентСервер.ЗагруженноеЗначение("", МетаРеквизит, "", "");
		МодельДокумента.Вставить("НомерПроформы", ТекЗнч);
		
	КонецЕсли; 
	
	Если МодельДокумента.Свойство("Дата") Тогда
		
		ДатаДок = МодельДокумента.Дата.Значение; 
		Если НЕ ЗначениеЗаполнено(ДатаДок) Тогда
			
			ДатаДок = ТекущаяДатаСеанса();
			МодельДокумента.Дата.Значение = ДатаДок;
			
		КонецЕсли; 
		
	Иначе	
		
		ДатаДок = ТекущаяДатаСеанса();
		МетаРеквизит = ПсевдоМетаданные.СтандартныеРеквизиты.Найти("Дата");
		ТекстДата = Формат(ДатаДок, "ДЛФ=D");
		ТекЗнч = бит_ПроформыКлиентСервер.ЗагруженноеЗначение(ТекстДата, МетаРеквизит, "", ДатаДок);
		МодельДокумента.Вставить("Дата", ТекЗнч);
		
	КонецЕсли; 
	
КонецПроцедуры // ЗаполнитьНомерДату() 

// Процедура распознает данные, загруженные из Эксель, и записывает в проформы. 
// 
// Параметры:
//  КоллекцияДанныхОбщ - Структура.
// 
&НаСервере
Процедура ОбработатьЗагруженныеДанные(Знач КоллекцияДанныхОбщ)
	
	Для каждого КиЗ Из КоллекцияДанныхОбщ Цикл
		
		КомплектДанных = КиЗ.Значение;
		
		СпискиИсточники  = КомплектДанных.СпискиИсточники;
		ПсевдоМетаданные = КомплектДанных.ПсевдоМетаданные;
		МодельДокумента  = КомплектДанных.МодельДокумента;
		
		Документы.бит_ФормаСбораДанных.РаспознатьДанные(МодельДокумента, ПсевдоМетаданные, СпискиИсточники);
		
		ЗаполнитьНомерДату(МодельДокумента, ПсевдоМетаданные);
		
		НайденнаяПроформа = Документы.бит_ФормаСбораДанных.ПустаяСсылка();
		Если ЗначениеЗаполнено(МодельДокумента.НомерПроформы.Значение) Тогда
			НайденнаяПроформа = Документы.бит_ФормаСбораДанных.НайтиПоРеквизиту("НомерПроформы");
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(НайденнаяПроформа) Тогда
		
			ДокОбъект = НайденнаяПроформа.ПолучитьОбъект();
			
		Иначе
			
			ДокОбъект = Документы.бит_ФормаСбораДанных.СоздатьДокумент();
		
		КонецЕсли; 
		
		флНовый = ?(ЗначениеЗаполнено(ДокОбъект.Ссылка), Ложь, Истина);
		
		Если НЕ флНовый И НЕ Объект.РазрешитьПерезапись Тогда
			
			ТекстСообщения = НСтр("ru='Проформа вида ""%1"" № вх. %2 от %3 была создана ранее. Перезапись запрещена. 
									  |Для разрешения перезаписи установите флаг ""Разрешить перезапись"" в настройках обработки.';
								  |en='Proform type ""%1"" № inc. %2 dated %3 is already created. Rewriting is prohibited
								  	  |To enable overwriting, set the ""Allow overwriting"" flag in the processing settings.'");									 
			ТекстСообщения = СтрШаблон(ТекстСообщения, КомплектДанных.ВидПроформы, 
									   МодельДокумента.НомерПроформы.Значение, МодельДокумента.Дата.Значение);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		
		КонецЕсли; 
		
		// Заполнение данных документа
		
		// Заполнение реквизитов шапки шапки
		ДокОбъект.ДанныеШапки.Очистить();		
		Для каждого МетаРеквизит Из ПсевдоМетаданные.Реквизиты Цикл
			
			ЗагруженныйЭлемент = Неопределено;
			Имя = МетаРеквизит.Имя;
			Если МодельДокумента.Свойство(МетаРеквизит.Имя, ЗагруженныйЭлемент) Тогда
				
				ЗначениеРеквизита = ЗагруженныйЭлемент.Значение;
								
				Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
				
					НоваяСтрока = ДокОбъект.ДанныеШапки.Добавить();
					НоваяСтрока.ИмяРеквизита = Имя;
					НоваяСтрока.ЗначениеРеквизита = ЗначениеРеквизита;
				
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла; // Реквизиты
		
		// Стандартные реквизиты
		ДокОбъект.ВидФормыСбораДанных = КомплектДанных.ВидПроформы;
		Для каждого МетаРеквизит Из ПсевдоМетаданные.СтандартныеРеквизиты Цикл
			
			Если МетаРеквизит.Имя = "Номер" Тогда
				Продолжить;
			КонецЕсли; 
			
			ЗагруженныйЭлемент = Неопределено;
			Имя = МетаРеквизит.Имя;
			Если МодельДокумента.Свойство(МетаРеквизит.Имя, ЗагруженныйЭлемент) Тогда
				
				ЗначениеРеквизита = ЗагруженныйЭлемент.Значение;
					
				ДокОбъект[Имя] = ЗначениеРеквизита;
				
			КонецЕсли; 
			
		КонецЦикла; 
		Если флНовый Тогда
			
			ДокОбъект.УстановитьНовыйНомер();
			
		КонецЕсли; 
		
		// Обработка ситуации незаполненной валюты и курсов.
		Если НЕ ЗначениеЗаполнено(ДокОбъект.ВалютаДокумента) Тогда
		
			ДокОбъект.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
			ДокОбъект.КурсДокумента   = 1;
			ДокОбъект.КратностьДокумента = 1;
		
		КонецЕсли; 
		
		Если ДокОбъект.КурсДокумента = 0 ИЛИ ДокОбъект.КратностьДокумента = 0 Тогда
			
			СтрКурса = бит_КурсыВалют.ПолучитьКурсВалюты(ДокОбъект.ВалютаДокумента, ДокОбъект.Дата);
			ДокОбъект.КурсДокумента = СтрКурса.Курс;
			ДокОбъект.КратностьДокумента = СтрКурса.Кратность;
			
		КонецЕсли; 
		
		// Заполнение табличных частей
	    ТабДанныеТабличныхЧастей = Документы.бит_ФормаСбораДанных.КонструкторТаблицыХраненияТабЧасти();		
		Для каждого КиЗ Из ПсевдоМетаданные.ТабличныеЧасти Цикл
			
			МетаТабЧасть = КиЗ.Значение;
			
			Если МодельДокумента.Свойство(МетаТабЧасть.Имя) Тогда
				
				ТабДанные = МодельДокумента[МетаТабЧасть.Имя].ТаблицаДанных;
				Колонки = ТабДанные.Колонки;
				
				инд = 1;
				Для каждого СтрокаТаблицы Из ТабДанные Цикл
					
					Для каждого МетаРеквизит Из МетаТабЧасть.Реквизиты Цикл
					
						
						Если Колонки.Найти(МетаРеквизит.Имя) = Неопределено Тогда
						
							Продолжить;
						
						КонецЕсли; 
						
						ЗначениеРеквизита = СтрокаТаблицы[МетаРеквизит.Имя];
						
						Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
							
							НоваяСтрока = ТабДанныеТабличныхЧастей.Добавить();
							НоваяСтрока.ИмяТабличнойЧасти  = МетаТабЧасть.Имя;
							НоваяСтрока.НомерСтрокиТаблицы = инд;
							НоваяСтрока.ИмяРеквизита       = МетаРеквизит.Имя;
							НоваяСтрока.ЗначениеРеквизита  = ЗначениеРеквизита;
							
						КонецЕсли; 
					
					КонецЦикла;  // МетаТабЧасть.Реквизиты
					
					инд = инд+1;
				КонецЦикла; // ТабДанные
				
			КонецЕсли; 
			
		КонецЦикла; // ТабЧасти
		
		СохранитьДанныеТабЧастей(ДокОбъект, ТабДанныеТабличныхЧастей);
		
		ТекРежимЗаписи = ?(Объект.РежимЗаписи="Проведение",РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись);		
		
		Если ДокОбъект.Проведен Тогда
		
			 ТекРежимЗаписи = РежимЗаписиДокумента.Проведение;
		
		КонецЕсли; 
		
		флДействиеВыполнено = бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ДокОбъект, ТекРежимЗаписи, ,Объект.РежимСообщений);
		
		Если флНовый И флДействиеВыполнено Тогда
		
			 НоваяСтрока = Объект.СозданныеОбъекты.Добавить();
			 НоваяСтрока.СозданныйОбъект = ДокОбъект.Ссылка;
		
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры // ОбработатьЗагруженныеДанные() 

&НаСервереБезКонтекста
Процедура СохранитьДанныеТабЧастей(ТекущийОбъект, ТабДанные)

	ТекущийОбъект.ДанныеТабличныхЧастей.Очистить();
	
	Предел = Документы.бит_ПроизвольнаяФорма.ПредельныйРазмерТабЧасти();
	
	Если ТабДанные.Количество() > Предел Тогда
		// Данные необходимо хранить в регистре сведений, т.к. превышен предельный размер табличной части.
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ДанныеТабличныхЧастей", ТабДанные);
	Иначе	
		// Заполнение табличной части
		ТекущийОбъект.ДанныеТабличныхЧастей.Загрузить(ТабДанные);
	КонецЕсли; 

КонецПроцедуры

// Процедура управляет доступностью элементов формы. 
// 
// Параметры:
//  Доступность - Булево.
// 
&НаСервере
Процедура УправлениеДоступностьюЭлементов(Доступность)
	
	Элементы.ФормаКомандаЗагрузить.Доступность = Доступность;	
	Элементы.Путь.Доступность = Доступность;
	Элементы.ДеревоДанныеКомандаОбновить.Доступность = Доступность;
	
КонецПроцедуры // УправлениеДоступностьюЭлементов()

// Процедура обновляет ДеревоДанные.
// 
// Параметры:
//  МодельДерева - Массив
// 
&НаСервере
Процедура ОбновитьДерево(МодельДерева)

	ДеревоДанные.ПолучитьЭлементы().Очистить();
	
	КоллекцияВерх = ДеревоДанные.ПолучитьЭлементы();
	
	Для каждого МодельВерх Из МодельДерева Цикл
		
		ЭлементВерх = КоллекцияВерх.Добавить();
		ЗаполнитьЗначенияСвойств(ЭлементВерх, МодельВерх);
		
		КоллекцияЛисты = ЭлементВерх.ПолучитьЭлементы();
		
		Для каждого МодельЛист Из МодельВерх.Подчиненные Цикл
			
			Если ЗначениеЗаполнено(МодельЛист.ИмяПроформы) Тогда
				
				ВидПроформы = Справочники.бит_ВидыФормСбораДанных.НайтиПоРеквизиту("Имя",МодельЛист.ИмяПроформы);
				
				Если ЗначениеЗаполнено(ВидПроформы) Тогда
					
					ЭлементЛист = КоллекцияЛисты.Добавить();
					ЗаполнитьЗначенияСвойств(ЭлементЛист, МодельЛист);
					ЭлементЛист.ВидПроформы = ВидПроформы;
					
					Если НЕ КоллекцияПсевдоМета.Свойство(МодельЛист.ИмяПроформы) Тогда
					
						ПсевдоМета = бит_РаботаСПроизвольнымиФормами.ЭмулироватьМетаданные(ВидПроформы);
						КоллекцияПсевдоМета.Вставить(МодельЛист.ИмяПроформы, ПсевдоМета);
					
					КонецЕсли; 
					
				Иначе	
					
					ТекстСообщения = НСтр("ru = 'Не удалось найти вид проформы по имени %1.';
										  |en = 'Failed to find the type of proforma by it’s name %1.'");
					ТекстСообщения = СтрШаблон(ТекстСообщения, МодельЛист.ИмяПроформы);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		Если КоллекцияЛисты.Количество() = 0 Тогда
		
			ЭлементВерх.Выполнять = Ложь;
		
		КонецЕсли; 
		
	КонецЦикла; 

КонецПроцедуры // ОбновитьДерево()

// Процедура удаляет загруженные объекты.
// 
&НаСервере
Процедура УдалитьЗагруженныеОбъекты()
	
	// На только что созданные объекты не может быть ссылок. 
	// При необходимости, если были загружены неверные данные можно их удалить.
	
	КоличествоСтрок = Объект.СозданныеОбъекты.Количество();
	
	Для Ном = 1 По КоличествоСтрок Цикл
		
		ТекНом    = КоличествоСтрок-Ном;
		ТекСтрока = Объект.СозданныеОбъекты[ТекНом];
		
		Если ТекСтрока.Выполнять Тогда
							
			Попытка
				
				// Удаление объекта.
				СтрокаДляСообщения = Строка(ТекСтрока.СозданныйОбъект);
				ТекОбъект = ТекСтрока.СозданныйОбъект.ПолучитьОбъект();
				ТекОбъект.Заблокировать();				
				ТекОбъект.Удалить();
				
				// Удаление строки табличной части.
				Объект.СозданныеОбъекты.Удалить(ТекСтрока);
				
				ТекстСообщения = НСтр("ru='Удален объект %1.';en='Object %1 removed.'");
			    ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаДляСообщения);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				
			Исключение
				
				ТекстСообщения = НСтр("ru='Не выполнено удаление объекта.';en='Object was not deleted.'");
				ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			КонецПопытки;
			
		КонецЕсли; 
		
	КонецЦикла; // КоличествоСтрок
	
КонецПроцедуры // УдалитьЗагруженныеОбъекты()

// Процедура выполняет загрузку данных из Эксель. На клиенте выполняется чтение данных из Эксель, 
// затем для обработки загруженных данных вызывается серверная процедура ОбработатьЗагруженныеДанные(). 
// 
&НаКлиенте
Процедура ЗагрузитьДанные()

	Отказ = Ложь;
	
	ТекущееПриложение = бит_ОбменДаннымиКлиент.InitExcel(Ложь, Отказ);
	
	Если Отказ Тогда	
		Возврат;	
	КонецЕсли; 
	
	КоллекцияДанныхОбщ = Новый Соответствие;
	
	КоллекцияВерх = ДеревоДанные.ПолучитьЭлементы();
	
	Для каждого ЭлементВерх Из КоллекцияВерх Цикл
	
		Если НЕ ЭлементВерх.Выполнять Тогда		
			Продолжить;		
		КонецЕсли; 
		
		КоллекцияЛисты = ЭлементВерх.ПолучитьЭлементы();
		
		ЛистыКЗагрузке = Новый Массив;
		
		Отказ = Ложь;
		ИмяФайла = ЭлементВерх.ИмяФайла;
		ТекущаяКнига = бит_ОбменДаннымиКлиент.OpenExcelFile(ТекущееПриложение, ИмяФайла, Отказ); 
		
		СпискиИсточники = бит_ПроформыКлиентСервер.ПрочитатьСпискиИсточники(ТекущаяКнига);
		
		
		Для каждого ЭлементЛист Из КоллекцияЛисты Цикл
			
			Если НЕ ЭлементЛист.Выполнять ИЛИ НЕ ЗначениеЗаполнено(ЭлементЛист.ВидПроформы) Тогда				
				Продолжить;				
			КонецЕсли;			
			
			Отказ = Ложь;				
			ТекущийЛист = бит_ОбменДаннымиКлиент.GetExcelSheet(ТекущаяКнига, ЭлементЛист.ИмяЛиста, Отказ);
			
			Если НЕ Отказ Тогда
				
				ИмяПроформы = String(ТекущийЛист.Cells(1,1).Value);
				ВидЛиста    = String(ТекущийЛист.Cells(2,1).Value);
				ИмяТабЧасти = String(ТекущийЛист.Cells(3,1).Value);
				
				Ключ = ЭлементЛист.ИмяФайла+"_"+ИмяПроформы;
				
				КомплектДанных = КоллекцияДанныхОбщ[Ключ];
				
				Если КомплектДанных = Неопределено Тогда
					
					КомплектДанных = Новый Структура;
					КомплектДанных.Вставить("ИмяПроформы", ИмяПроформы);
					
					ПсевдоМета = КоллекцияПсевдоМета[ИмяПроформы];
					КомплектДанных.Вставить("ПсевдоМетаданные", ПсевдоМета);
					КомплектДанных.Вставить("ВидПроформы"     , ЭлементЛист.ВидПроформы); 
					КомплектДанных.Вставить("СпискиИсточники" , СпискиИсточники);
					КомплектДанных.Вставить("МодельДокумента" , Новый Структура);
					
					КоллекцияДанныхОбщ.Вставить(Ключ, КомплектДанных);
					
				КонецЕсли; 
				
				Если ВидЛиста = "Шапка" Тогда
					
					бит_ПроформыКлиент.ПрочитатьДанныеШапки(ТекущаяКнига, ТекущийЛист, КомплектДанных.ПсевдоМетаданные, ИмяПроформы, КомплектДанных.МодельДокумента);
					
				КонецЕсли; 
				
				Если НЕ ПустаяСтрока(ИмяТабЧасти) Тогда
					
					 МетаТабЧасть = Неопределено;
					 КомплектДанных.ПсевдоМетаданные.ТабличныеЧасти.Свойство(ИмяТабЧасти, МетаТабЧасть);
					 
					 Если МетаТабЧасть <> Неопределено Тогда
					 
					 	 ДанныеТЧ = бит_ПроформыКлиент.ПрочитатьДанныеТабЧасти(ТекущийЛист, МетаТабЧасть, ИмяПроформы); 
						 КомплектДанных.МодельДокумента.Вставить(МетаТабЧасть.Имя, ДанныеТЧ);
					 
					 КонецЕсли; 
					 
				КонецЕсли; 

				
			КонецЕсли; 
			
			
		КонецЦикла; // По листам
		
		бит_ОбменДаннымиКлиент.CloseExcelFile(ТекущаяКнига, Ложь);
		
	КонецЦикла; // По файлам
	
	бит_ОбменДаннымиКлиент.QuitExcel(ТекущееПриложение);
	
	ОбработатьЗагруженныеДанные(КоллекцияДанныхОбщ);
	
	ТекстСообщения =  НСтр("ru = 'Загрузка завершена.'; en = 'Loading completed.'");
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры // ЗагрузитьДанные()

// Процедура-обработчик ожидания выбора пути к каталогу с данными. 
// 
&НаКлиенте
Процедура ОжиданиеВыбораПути()
		
	ОбновитьДеревоДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоДанные()

	Если ПустаяСтрока(Объект.Путь) Тогда
		УправлениеДоступностьюЭлементов(Истина);
		Возврат;	
	КонецЕсли; 
	
	ТекстСостояние = НСтр("ru='Анализ файлов Microsoft Excel...';en='Analyzing Microsoft Excel files ...'");
	Состояние(ТекстСостояние);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьДеревоДанныеЗавершение", ЭтотОбъект); 
	
	Если Объект.РежимВыбора = 1 Тогда
		МассивФайлов = Новый Массив;
		Для каждого ТекПуть Из ВыбранныеФайлы Цикл
			ТекФайл = Новый Файл(ТекПуть);
			МассивФайлов.Добавить(ТекФайл);
		КонецЦикла; 
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, МассивФайлов);
	Иначе	
		НачатьПоискФайлов(ОписаниеОповещения, Объект.Путь, "*.xlsx", Истина); 
	КонецЕсли; 

КонецПроцедуры
 
&НаКлиенте
Процедура ОбновитьДеревоДанныеЗавершение(МассивФайлов, ДополнительныеПараметры) Экспорт
	
	ИмяИсточникСписков = бит_ПроформыКлиентСервер.ListSourceSheetName();
	
	Если ТипЗнч(МассивФайлов) = Тип("Массив") И МассивФайлов.Количество() > 0 Тогда
		
		Отказ = Ложь; 
		
		ТекущееПриложение = бит_ОбменДаннымиКлиент.InitExcel(Ложь, Отказ);		
		Если Отказ Тогда
			Возврат;
		КонецЕсли; 
		
		МодельДерева = Новый Массив;
		Для каждого ТекФайл Из МассивФайлов Цикл
			
			Если ТекФайл.Существует() Тогда
				
				ТекущаяКнига = бит_ОбменДаннымиКлиент.OpenExcelFile(ТекущееПриложение, ТекФайл.ПолноеИмя, Отказ);				
				Если НЕ Отказ Тогда
					
					МассивМоделейСтрок = Новый Массив;
					
					Для каждого ТекущийЛист Из ТекущееПриложение.Sheets Цикл
						
						ИмяЛиста = ТекущийЛист.Name;
						Если ИмяЛиста = ИмяИсточникСписков Тогда							
							Продолжить;							
						КонецЕсли; 
						
						ИмяПроформы = String(ТекущийЛист.Cells(1,1).Value);
						МодельСтроки = МодельСтрокиДерева(ТекФайл.ПолноеИмя, ИмяЛиста, ИмяЛиста, ИмяПроформы, Новый Массив);
						МассивМоделейСтрок.Добавить(МодельСтроки);
						
					КонецЦикла; 
					
					МодСтрокаВерх = МодельСтрокиДерева(ТекФайл.ПолноеИмя, "", ТекФайл.ПолноеИмя, "", МассивМоделейСтрок);
					
					МодельДерева.Добавить(МодСтрокаВерх);
					
				КонецЕсли; 
				
				бит_ОбменДаннымиКлиент.CloseExcelFile(ТекущаяКнига, Ложь);
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		ОбновитьДерево(МодельДерева);
		бит_РаботаСДиалогамиКлиент.РазвернутьДеревоПолностью(Элементы.ДеревоДанные, ДеревоДанные.ПолучитьЭлементы(), Истина);
		
		бит_ОбменДаннымиКлиент.QuitExcel(ТекущееПриложение);
		
	КонецЕсли; 
	
	УправлениеДоступностьюЭлементов(Истина);

КонецПроцедуры

// Процедура изменяет флажки в ДеревеДанные.
// 
// Параметры:
//  ЭлементВерх  - ДанныеФормыЭлементДерева.
//  КодДействия  - Число: 0-Снять,1 - Установить, 2-Инвертировать.
// 
&НаКлиенте
Процедура ИзменитьФлажки(ЭлементВерх,КодДействия)
	
	Коллекция = ЭлементВерх.ПолучитьЭлементы();
	Для каждого ТекЭлемент Из Коллекция Цикл
		ИдентификаторСтроки = ТекЭлемент.ПолучитьИдентификатор();
		Если Элементы.ДеревоДанные.ПроверитьСтроку(ИдентификаторСтроки) = Истина Тогда // Может быть Неопределено.
			Если КодДействия = 0 Тогда
				ТекЭлемент.Выполнять = Ложь;
			ИначеЕсли КодДействия = 1 Тогда
				ТекЭлемент.Выполнять = Истина;
			ИначеЕсли КодДействия = 2 Тогда	
				ТекЭлемент.Выполнять = Не ТекЭлемент.Выполнять;
			КонецЕсли; 
			ИзменитьФлажки(ТекЭлемент,КодДействия);
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры // ИзменитьФлажки()

// Процедура устанавливает заголовок формы.
// 
&НаКлиенте
Процедура УстановитьЗаголовокФормы()

	Если ЗначениеЗаполнено(ТекущаяНастройка) Тогда
		ТекстЗаголовка = НСтр("ru = 'Загрузка форм сбора данных (%1)';
							  |en = 'Download data collection forms (%1)'");
		ТекстЗаголовка = СтрШаблон(ТекстЗаголовка, ТекущаяНастройка);
		ЭтотОбъект.Заголовок = ТекстЗаголовка;
	Иначе	
		ЭтотОбъект.Заголовок = НСтр("ru = 'Загрузка форм сбора данных';
									|en = 'Download data collection forms'");
	КонецЕсли; 

КонецПроцедуры // УстановитьЗаголовокФормы()

// Функция-конструктор структуры, моделирующей строку дерева.
// 
// Параметры:
//  ИмяФайла - Строка
//  ИмяЛиста - Строка
//  Представление - Строка
//  ИмяПроформы - Строка
//  Подчиненные - Массив
// 
// Возвращаемое значение:
//  МодельСтроки - Структура.
// 
&НаКлиентеНаСервереБезКонтекста
Функция МодельСтрокиДерева(ИмяФайла, ИмяЛиста, Представление, ИмяПроформы, Подчиненные)

	МодельСтроки = Новый Структура();
	МодельСтроки.Вставить("Выполнять"	 , Истина);
	МодельСтроки.Вставить("ИмяФайла"	 , ИмяФайла);
	МодельСтроки.Вставить("ИмяЛиста"	 , ИмяЛиста);
	МодельСтроки.Вставить("Представление", Представление);
	МодельСтроки.Вставить("ИмяПроформы"  , ИмяПроформы);
	МодельСтроки.Вставить("Подчиненные"  , Подчиненные);	

	Возврат МодельСтроки;
	
КонецФункции // МодельСтрокиДерева()

#КонецОбласти
